Ran Plan for dir: `poc/dev/fulfillment` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_backend_service.default will be created
  + resource "google_compute_backend_service" "default" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "fulfillment-controller-backend"
      + port_name                       = (known after apply)
      + project                         = (known after apply)
      + protocol                        = (known after apply)
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = "projects/ccai-df-mva-lab1/regions/us-central1/networkEndpointGroups/fulfillment-us-central1-neg"
          + max_utilization = 0.8
        }
      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = "projects/ccai-df-mva-lab1/regions/us-east1/networkEndpointGroups/fulfillment-us-east1-neg"
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }

      + log_config {
          + enable      = false
          + sample_rate = 1
        }
    }

  # google_compute_global_address.default will be created
  + resource "google_compute_global_address" "default" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "fulfillment-controller-address"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_compute_global_forwarding_rule.http will be created
  + resource "google_compute_global_forwarding_rule" "http" {
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "fulfillment-controller-http"
      + port_range            = "80"
      + project               = (known after apply)
      + self_link             = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_global_forwarding_rule.https will be created
  + resource "google_compute_global_forwarding_rule" "https" {
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "fulfillment-controller-https"
      + port_range            = "443"
      + project               = (known after apply)
      + self_link             = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_managed_ssl_certificate.default will be created
  + resource "google_compute_managed_ssl_certificate" "default" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "fulfillment-controller-cert"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "*.fulfillment.ccai.disrupttechlabs.com",
            ]
        }
    }

  # google_compute_target_http_proxy.default will be created
  + resource "google_compute_target_http_proxy" "default" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "fulfillment-controller-http-proxy"
      + project            = (known after apply)
      + proxy_id           = (known after apply)
      + self_link          = (known after apply)
      + url_map            = (known after apply)
    }

  # google_compute_target_https_proxy.default will be created
  + resource "google_compute_target_https_proxy" "default" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "fulfillment-controller-https-proxy"
      + project            = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + url_map            = (known after apply)
    }

  # google_compute_url_map.default will be created
  + resource "google_compute_url_map" "default" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "fulfillment-controller-url-map"
      + project            = (known after apply)
      + self_link          = (known after apply)

      + default_url_redirect {
          + https_redirect = false
          + path_redirect  = "/"
          + strip_query    = true
        }

      + host_rule {
          + hosts        = [
              + "*",
            ]
          + path_matcher = "default"
        }

      + path_matcher {
          + name = "default"

          + route_rules {
              + priority = 1
              + service  = (known after apply)

              + match_rules {
                  + ignore_case  = false
                  + prefix_match = "/webhook"

                  + header_matches {
                      + exact_match  = "password"
                      + header_name  = "df_auth"
                      + invert_match = false
                    }
                }
            }
        }
    }

  # google_compute_url_map.https_redirect will be created
  + resource "google_compute_url_map" "https_redirect" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "fulfillment-controller-https-redirect"
      + project            = (known after apply)
      + self_link          = (known after apply)

      + default_url_redirect {
          + https_redirect         = true
          + redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
          + strip_query            = false
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d poc/dev/fulfillment`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.193.191.10:4141/lock?id=tandonc%252Fterraform-google-ccai%252Fpoc%252Fdev%252Ffulfillment%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d poc/dev/fulfillment`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
